{"meta":{"title":"徐天亚的小屋","subtitle":"","description":"","author":"尼古拉斯","url":"https://xutianya.github.io","root":"/"},"pages":[{"title":"tags","date":"2021-05-22T06:36:21.000Z","updated":"2021-05-22T06:36:43.407Z","comments":false,"path":"tags/index.html","permalink":"https://xutianya.github.io/tags/index.html","excerpt":"","text":""},{"title":"分类","date":"2021-05-22T06:34:19.000Z","updated":"2021-05-23T04:07:45.519Z","comments":false,"path":"categories/index.html","permalink":"https://xutianya.github.io/categories/index.html","excerpt":"","text":""},{"title":"about","date":"2021-05-22T09:18:06.000Z","updated":"2021-05-23T02:52:53.179Z","comments":false,"path":"about/index.html","permalink":"https://xutianya.github.io/about/index.html","excerpt":"","text":""},{"title":"相册","date":"2021-05-22T11:24:41.000Z","updated":"2021-05-23T02:40:30.628Z","comments":true,"path":"PhotoAlbum/index.html","permalink":"https://xutianya.github.io/PhotoAlbum/index.html","excerpt":"","text":"相册有待完善...... ❤️ 待补充 ❤️ ​ 待补充 待补充 待补充 待补充 待补充 待补充 ☀️ 待补充 ☀️ 待补充 待补充 待补充 待补充 待补充 待补充"},{"title":"留言板","date":"2021-05-22T09:32:00.000Z","updated":"2021-05-23T06:15:13.543Z","comments":true,"path":"comment/index.html","permalink":"https://xutianya.github.io/comment/index.html","excerpt":"","text":"发开中..."},{"title":"donate","date":"2021-05-22T11:34:19.000Z","updated":"2021-05-22T11:34:58.013Z","comments":false,"path":"donate/index.html","permalink":"https://xutianya.github.io/donate/index.html","excerpt":"","text":""},{"title":"小屋记事","date":"2021-05-23T04:13:04.000Z","updated":"2021-05-23T07:55:10.754Z","comments":true,"path":"homeLog/index.html","permalink":"https://xutianya.github.io/homeLog/index.html","excerpt":"","text":"❤️我们的爱情❤️ SiteTimeline 改变的是流年，不变的是记忆 2021/02/2023:38 萌发建立小屋的念头 当时就开始下载各种纪念爱情的app开始构思 2021/02/22 17:24 确定网站以日历形式记录爱情故事 经过修改后小屋1.0制作完成,当时只是一个静态的页面 2021/02/23 12:30 部署小屋 在阿里云上买了香港的云服务器(香港不需要备案省去一些时间)和域名,原本想 将域名注册为aizhujie,可惜被人抢先一步o(╥﹏╥)o 所以决定域名为izhujie 2021/02/26 20:35 重构小屋 经过几个通宵给小屋修改了样式,添加了菜单,留言板等功能 2021/05/08 09:16 再次萌发重构小屋的想法 由于我不喜欢微信浏览器自带的底部导航栏,所以我将小屋2.0的页面基本都是揉在一起,导致调样式的时候相当恶心,于是决定重构小屋 此次省略几千字的踩坑学习过程..... 2020/05/20 13:14 时机已到,开始搭建小屋3.0 严格的说不能称之为小屋3.0,因为跟之前的2.0没有一毛钱的关系O(∩_∩)O哈哈~ 本站由Hexo 强力驱动,主题使用基于Sakura主题进行二次修改的Sakura T，目前还在完善中 现在网站采用的github仓库, 使用github pages托管网站 2021/05/23 12:33 优化 由于国内访问github不稳定,所以在github新建一个CDN仓库将一些静态资源发布后,使用jsdelivr加速 2021/05/23 13:37 TODO 背景切换主题 留言板功能 关于 爱的信件 清单 音乐 视频 相册"}],"posts":[{"title":"一堵墙 一段情","slug":"一堵墙,一段情","date":"2021-05-23T09:20:22.000Z","updated":"2021-05-23T07:43:12.841Z","comments":true,"path":"2021/05/23/一堵墙,一段情/","link":"","permalink":"https://xutianya.github.io/2021/05/23/%E4%B8%80%E5%A0%B5%E5%A2%99,%E4%B8%80%E6%AE%B5%E6%83%85/","excerpt":"","text":"​ 1959年，女人成了寡妇。丈夫突然撒手而去，撇下她和两个妞妞。那是三年困难时期的头一年，那年金妞三岁，银妞一岁。两个女娃天天趴在炕头号啕大哭，把女人啃得青一块紫一块。好几次女人动了死的心思。两只手分别掐住两个妞妞的脖子，到最后，又缩了手。她把自己的头发一把一把往下揪。 瘦得只剩一把骨头的女人在院里的麦秸垛下捡麦粒。那是去年的麦秸垛，女人幻想能在下面捡些麦粒给妞妞们熬碗粥。正是春天，太阳无精打采地照着，院子里的月季刚鼓出花苞。女人饿极了，摘一朵花苞塞嘴里嚼，竟然满嘴甜香。女人乐坏了，忙摘了几朵往屋里跑。跑得急，被门槛绊了一跤，下巴磕得血肉模糊。躺在地上的女人仍咧开嘴笑：“妞妞咱们有吃的了！” 男人是女人的邻居，两家一墙之隔。下过雨，土墙垮掉一角，男人重新把土墙垒起来。却没垒到原来的高度，那里多出一个弧形的缺口。 夜里女人听到院子里“砰砰”两声，像有人跳了进来。胆战心惊的女人抽出枕头下面的菜刀，随时准备拼命。她等了很久，院子里再也没有动静。女着胆子来到院子，竟发现地上躺着两根翠绿的萝卜。女人眼，拾了萝卜，去灶台生了火。她要给两个妞妞熬些汤。她知道她们需要这两根萝卜。 女人对男人的感觉，只有害怕。那是一个身高只及她腰部的男人，女人知道那叫侏儒。侏儒没有爹娘，更不会有老婆。侏儒十几岁去上海混戏班子，混到三十多岁又回到村子，就再也没有离开。有时女人不小心跟他打了照面，立刻魂飞魄散。那是怎样的一个男人啊！他长着一张猩猩般丑陋的脸，他的胳膊长及膝盖，他的两只眼睛深陷进去，闪着浑浊幽蓝的光。他笑着摸摸金妞的脸说：“叫叔。”金妞“哇”一声哭起来，像撞了鬼。 以后的每天夜里，那缺口都会飞来一些东西。半棵白菜，几片薯干，一根萝卜，或者几个麦穗。这些东西让女人和两个妞妞挺过了最难挨的三年。那时候全国人民都在挨饿，女人知道他也是吃了上顿没下顿。白天再见他，女人说：“兄弟，心意我领了，可是你也不好过啊。”他笑笑，说：“让妞妞们有口饭吃。”女人抹一把泪，转身走，又停住回头，说：“兄弟，如果夜里闷，就来嫂子家坐坐。”那张丑陋的脸就红了。红了后，就不再吱声，低了头匆匆离开。 夜里女人坐在院子里等他。等来的，却是从缺口扔过来的一把黄豆。女人就着月光慢慢地捡，边捡边哭，直到天明。 饥荒终于过去，尽管仍然吃不饱，却不至于饿死。可是夜里仍然有东西从那个缺口扔过来，从不间断。白天女人遇见他，说：“兄弟，别再扔了，用不着了。”他嘿嘿笑，不说话。晚上，女人家的院子里，仍然会多出一些东西。 灾难说来就来，没有任何前兆。村子里突然多出一些奇怪的标语，然后有人将男人揪上土台，喝令他站好。他们抽他耳光，向他啐口水。他们怀疑他在上海通过敌，甚至为敌人送过。男人挺起胸膛，大声喊：“一派胡言！”当然，这为他招来了更多的耳光。女人远远地看着，心一下一下地紧着，仿佛那些耳光打中了自己。 夜里他被放回来，一个人走进黑暗。女人听见他在院子里抽泣，自己也跟着抹眼泪。正哭着，两个萝卜落到身边。女人终于忍不住了，她扯开嗓子号啕大哭起来。 后来那些人终于不再折磨他，因为他傻了。有人让他爬上高高的凳子，怒喝道：“你给敌人送过吧？”他说：“一派胡言！”那人就抽了凳子。他从高处一头栽下，当场昏厥。等再次醒来，人就傻了。 他傻了，几乎忘掉一切。可是每天夜里，女人的院子里，仍然会落下些东西。半棵白菜，几片薯干，一根萝卜，或者几个麦穗。 他的门口，每天都守着人。他们不允许他和任何人接近。事实上，他也从来不主动和任何人接近。因为他性格孤僻，因为他是个侏儒，因为现在他变成了傻子。 女人在街上碰到他，悄悄地说：“兄弟，要是你不嫌弃，娶了我吧。两个人，日子好过一些……”他红了脸，嘿嘿笑。他说：“我是丑八怪。”女人说：“你不是丑八怪，你比他们都好看。”他呆在那里，支支吾吾说不出话。 日子一天天过去，女人一天天苍老。一天天苍老的女人，彻底失去了某一种心思。可是每天晚上，墙的缺口处仍然会飞过来一些东西，从没有间断过。那些东西让女人相信，在夜里，在墙那边，那个身材矮小的男人，的确是存在的。 后来，金妞远嫁给城里的工人，银妞也嫁给了本村的瓦匠。瓦匠跟着银妞来看娘，把礼物放下，在院子里一圈一圈地转。一会儿回屋，瓦匠说：“娘，这房子太破了，翻翻新吧。”女人说：“好。”瓦匠说：“还有这墙，这墙也重砌一下吧。”女人说：“不要。”瓦匠说：“娘，我都听说了，可是叔现在扔这些东西有什么用呢？他那样的年纪和身材，万一闪了腰，万一有个三长两短……墙砌高，缺口堵上，其实也是为他好。”女人说：“可是……”瓦匠说：“别可是了娘，接您去住您不去，偏守着这老房……彻底修一修吧。” 女人的墙被加固加高，不见了弧形的缺口。夜里女人一个人坐在院子里，看天上的月，墙那边再也不会扔过来几片薯干或者一根萝卜了吧？月亮从这个树梢钻到那个树梢，女人的心里空空荡荡。忽然女人听到墙那边“砰”的一声响，紧接着响起阵阵。女人站起来，疯了一样往那边跑。 门没拴，女人轻轻一撞，就开了。那是一个她完全陌生的院子。月光下女人看到矮小的他正躺在地上挣扎。他的手里攥着一根萝卜，旁边，翻倒着一条破旧的长凳。躺在地上的他咧开嘴笑。他说：“妞妞们有吃的了……” 三天后，他们举行了简单的婚礼。因为一堵墙，因为一些事，他们的婚礼，已经耽搁了太久。婚礼上的他只会傻笑，婚礼上的她只会流泪，可是人们知道，无论哪一种表情，在那时，都是深入骨髓的幸福…… 他们已经白了头发。可是那天，人们仍然，也只能，祝他们白头偕老……","categories":[{"name":"故事","slug":"故事","permalink":"https://xutianya.github.io/categories/%E6%95%85%E4%BA%8B/"}],"tags":[],"author":"周海亮"},{"title":"英雄","slug":"英雄","date":"2021-05-23T07:20:21.000Z","updated":"2021-05-23T07:43:21.365Z","comments":true,"path":"2021/05/23/英雄/","link":"","permalink":"https://xutianya.github.io/2021/05/23/%E8%8B%B1%E9%9B%84/","excerpt":"","text":"一 他二十岁的时候，她正好十岁。 她坐在台下，晶亮的眸子映照出台上英武的他。 他是学校请来的英雄，笔挺的军装上一张黝黑却棱角分明的脸，因为激动透着健康的红晕。 他在台上大声地念着手中的演讲稿，只剩下三根手指的右手高高举起，如同一面灼目的旗帜。在一次实弹演习中，面对一枚“咝咝”作响的手榴弹，他毫不犹豫地拣起来扔向远方，挽救了被吓呆的战友。 她的眼中噙满了泪水，朦胧间台上的他是那么高大英俊，连他那浓重的乡音都充满了亲切的味道。 “他真是个英雄，我会一辈子记住他的”她在心里默默地想。 二 他三十岁的时候，她二十岁。 学校组织学生们去农村体验生活。 如果不是村干部郑重地向大家介绍他曾经是个英雄，她是一丁点儿也认不出他了。 埋头在田里劳作的他跟其他的农民已没什么两样，披着一件灰扑扑的褂子，失却了红晕的脸还是那么黑，却变得暗沉。村干部介绍的时候，他憨憨的笑着，脸上，怎么也找不到十年前年轻的影子。 他坐在田头抽着烟卷，好几次她都想走过去跟他说几句话。看着烟头一明一灭，她终于还是没过去。 她实在想不出该对他说些什么。 三 他四十岁的时候，她三十岁。 他在她所在的城市摆了个摊，卖鸡蛋煎饼。 五岁的女儿吵着要吃煎饼，她先认出了他的手，再抬头看他的脸，恍若隔世般，已然很陌生了。 女儿香甜地啃着煎饼，她的心却一直不能平静。她忍不住悄悄告诉女儿，卖煎饼的是一个英雄，女儿吵闹着，要去看英雄。 她带着女儿折回去，女儿仔细看着那只残缺的手，然后“哇”地一声大哭起来。她匆忙带着女儿离开。一边哄着女儿，一边回忆自己十岁的时候第一次看见这只手时的心情，一点都不觉得害怕，只有深深的敬意。 她还记起来当时听完报告回到家，小小的她弯曲起两根手指，模仿他举起三指的样子，想象着那种悲壮。 四 他五十岁的时候，她四十岁。 她在民政局混上了科长的位置，工作还算清闲，生活不好不坏。当他在她办公室外面探头探脑的时候，她根本就没认出他，原来他是来申请追加困难补助的。她给他倒了杯茶水，他受宠若惊地捧着，只会一迭声地说谢谢。她陪着他办完了所有手续，而他不知道为何受到如此礼遇，越发地惶恐不安，一个小时里说了不下五十声的谢谢。 望着他佝偻着背离开，她开始努力回想他年轻时的样子，却怎么也想不起来了。 “他真的曾经是个英雄吗？”问自己这个问题的时候，她觉得那么茫然。 五 她五十岁的时候，他已经不在了。 那天她在办公室喝着茶，翻着报纸，四十年前的他突然映入眼帘。犹如被雷击般，她手中的茶杯怦然落地。 他在回乡的公交车上遇到一伙劫匪，一车人只有他挺身而出，搏斗中，被刺数刀身亡。报道还提到，他的右手只有三根手指，年轻时他就曾因救人成为部队里的英雄典型。那张穿着军装的年轻的照片，据说是他唯一的一张相片。 一瞬间，泪水又模糊了她的眼睛，恍如四十年前，小小的她坐在台下仰望。","categories":[{"name":"故事","slug":"故事","permalink":"https://xutianya.github.io/categories/%E6%95%85%E4%BA%8B/"}],"tags":[],"author":"立夏"},{"title":"他令情人节风靡世界","slug":"他令情人节风靡世界","date":"2021-05-23T06:46:46.000Z","updated":"2021-05-23T07:43:04.199Z","comments":true,"path":"2021/05/23/他令情人节风靡世界/","link":"","permalink":"https://xutianya.github.io/2021/05/23/%E4%BB%96%E4%BB%A4%E6%83%85%E4%BA%BA%E8%8A%82%E9%A3%8E%E9%9D%A1%E4%B8%96%E7%95%8C/","excerpt":"","text":"黎明的寂静突然被一阵嘈杂声打破，两个士兵一 边抱怨着一边推搡着他往监狱里走着。他紧闭着嘴 巴，拧皱着眉头，一双眼睛却格外明亮，放射着掩饰 不住的智慧、虔诚和坚毅，整洁的衣着更没有半点囚 犯样。士兵将他押到狱长的屋里接受审讯。狱长是一 个面色冷峻的老人，他的身旁坐了一个年轻的姑娘。 姑娘身体修长，面色红润，穿了一件白色长袍，看上 去很漂亮，美中不足的是本该清澈透明的眸子却像沼 泽一样灰暗无光——她是一个盲人。 “姓名？”狱长发问。 他平静地说出自己的名字。 “为什么被送到这儿来？” “这就要问你们了，我只是尽了我的职责，帮助 了被你们伤害的人……” 狱长没有反应，他身旁的姑娘却似乎被震动了一 下，身子坐得更直了，更认真地听着。 “你认罪吗？” “不，我没有罪。我只是做了我应该做的事情。” 他富有磁性、充满激情的声音弥漫在审讯室里，久久 回荡着。盲姑娘被这声音吸引了，突然问道：“先生， 你喜欢花吗？”这句奇怪的审讯词让他愣怔了一下， 继而，他换了一种温柔的语调回答着：“是的，我喜 欢花，小姐。我热爱自然，热爱人。” 狱长有些不耐烦了，吩咐把他带进监牢。他平静 地走了出去，临走前风度优雅地对女孩鞠了一躬：“谢 谢你的提问，小姐。”后来，他得知，女孩是狱长的 爱女，从小就双目失明，狱长对她疼爱有加。不知为 什么，他有一点淡淡的惆怅，心中总也挥不去那个白 色的、穿着长袍的修长影子。 晚饭的时候，狱长的女儿在一个狱卒的带领下来 到了牢房门口，她带来了丰盛的饭菜，对他说：“我 知道你是一个好人，有知识，有文化修养，以后我想 多跟你聊聊天，我从来没有看见过、接触过外面的世 界，你多告诉我一点，可以吗？”他虽有一点诧异， 但还是愉快地答应了。当天吃过晚饭后，两个人就一 起散步，聊天…… 第二天，女孩又来了。第三天，第四天……他们 一起谈论外面的世界，谈生活，谈爱情……渐渐地， 两个人的心里都产生一种朦胧的情况，越走越近。 狱长知道了，大发雷霆，把他找来狠狠地骂了一 顿，指责她勾引他的女儿。他向狱长坦白了自己对女 孩的感情，他的诚恳打动了狱长，再加上狱长拗不过 女儿的苦苦哀求，只好听之任之了。 他和女孩的感情越来越深，爱情让他完全忘记了 自己身在狱中。 一天，他在散步的路上发现了一种草药。略通医 术的他欣喜若狂，他知道这种草药可能会治好姑娘的 眼睛。一天天，他专心地熬着草药……可是，女孩的 眼睛没有等来光明，他却等来了他的判决书——死刑！ 这一天终于来了。清晨，他被押出了牢房走向后 山的刑场。他多想再看姑娘一眼啊！可是他不忍心让 姑娘知道这个悲惨的消息。 行刑官下达了最后的命令，在这生命的最后时 刻，他无限深情地回头望了望姑娘的小屋，奇迹出现 了，姑娘的眼睛复明了，正跌跌撞撞地向刑场跑来。 一路呼喊着他的名字，他的眼睛湿润了。他们都知道， 一松开失去的将是整个生命，整个幸福……多希望时 间能够永远停留在这个令人心醉的时刻，他们能够相 拥到永远！或者就来一场山崩地裂，来一场火山爆发 吧，让他们变成化石，变成熔岩，只要永远不分开！ 时间无法停下脚步，他还是失去了生命。不久， 姑娘也郁悒而死。 他的名字叫瓦伦丁，他逝世的那一天是公元前三 世纪的一个2月14日。后来，为了纪念他，教会将 这一天定为情人节。现在，情人节已经穿越悠长的岁 月时空，风靡世界的每一个角落，成为所有情人铭记 的日子。","categories":[{"name":"故事","slug":"故事","permalink":"https://xutianya.github.io/categories/%E6%95%85%E4%BA%8B/"}],"tags":[],"author":"匿名"},{"title":"测试","slug":"测试","date":"2021-05-22T05:46:46.000Z","updated":"2021-05-23T05:56:00.279Z","comments":true,"path":"2021/05/22/测试/","link":"","permalink":"https://xutianya.github.io/2021/05/22/%E6%B5%8B%E8%AF%95/","excerpt":"","text":"","categories":[{"name":"故事","slug":"故事","permalink":"https://xutianya.github.io/categories/%E6%95%85%E4%BA%8B/"}],"tags":[],"author":"徐天亚"}],"categories":[{"name":"故事","slug":"故事","permalink":"https://xutianya.github.io/categories/%E6%95%85%E4%BA%8B/"}],"tags":[]}